# 4.9 Intro to Data Visualization with Python part 1

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Creating path
path = r'C:\Users\avadr\27-01-2020 Instacart Basket Analysis'

In [3]:
# Import customers.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
# Dsiplay number of columns and rows
df_cust.shape

(206209, 10)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Renaming column name
df_cust.rename(columns = {'Surnam' : 'surname', 'fam_status' : 'marital_status', 'n_dependants' : 'dependants', 'STATE' : 'state', 'First Name' : 'first_name', 'Gender' : 'gender', }, inplace = True)

In [7]:
df_cust.head()

,user_id,first_name,surname,gender,state,Age,date_joined,dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   Age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
# Changing the date datatpye
df_cust['date_joined']=pd.to_datetime(df_cust['date_joined'])

In [10]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      194950 non-null  object
 2   surname         206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   Age             206209 non-null  int64
 6   date_joined     206209 non-null  datetime64[ns]
 7   dependants      206209 non-null  int64
 8   marital_status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 15.7+ MB

In [11]:
df_cust.describe()

,user_id,Age,date_joined,dependants,income
count,206209.000000,206209.000000,206209,206209.000000,206209.000000
mean,103105.000000,49.501646,2018-08-17 03:06:30.029532928,1.499823,94632.852548
min,1.000000,18.000000,2017-01-01 00:00:00,0.000000,25903.000000
25%,51553.000000,33.000000,2017-10-23 00:00:00,0.000000,59874.000000
50%,103105.000000,49.000000,2018-08-16 00:00:00,1.000000,93547.000000
75%,154657.000000,66.000000,2019-06-10 00:00:00,3.000000,124244.000000
max,206209.000000,81.000000,2020-04-01 00:00:00,3.000000,593901.000000
std,59527.555167,18.480962,NaN,1.118433,42473.786988

In [12]:
# Finding if there is any missing values
df_cust.isnull().sum()

user_id               0
first_name        11259
surname               0
gender                0
state                 0
Age                   0
date_joined           0
dependants            0
marital_status        0
income                0
dtype: int64

#### Ignoring missing values will have no influence on the final analysis because only the first name column has missing values.

In [13]:
# Finding duplicates
df_dups = df_cust[df_cust.duplicated()]

In [14]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, Age, date_joined, dependants, marital_status, income]
Index: []

In [15]:
# Check for mix type
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)
else :
    print ("None of the columns have mix data")

first_name
None of the columns have mix data

In [16]:
# Importing orders data setfrom pickle format from 
df_ords = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_.pkl'))

In [17]:
df_ords.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spending_flag,median_days_since_prior_order,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,most_orders,32,Regular customer,6.935811,low_spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,average_orders,32,Regular customer,6.935811,low_spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,average_orders,5,New customer,7.930208,low_spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,slowest_days,most_orders,3,New customer,4.972414,low_spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,slowest_days,average_orders,3,New customer,4.972414,low_spender,9.0,Frequent customer

In [18]:
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                         Dtype
---  ------                         -----
 0   product_id                     int64
 1   product_name                   object
 2   aisle_id                       int64
 3   department_id                  int64
 4   prices                         float64
 5   order_id                       int64
 6   user_id                        int64
 7   number_of_orders               int64
 8   orders_day_of_week             int64
 9   order_hour_of_day              int64
 10  days_since_prior_order         float64
 11  add_to_cart_order              int64
 12  reordered                      int64
 13  _merge                         category
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int64
 19  loyalty_flag                   object
 20  mean_price                     float64
 21  spending_flag                  object
 22  median_days_since_prior_order  float64
 23  frequency_flag                 object
dtypes: category(1), float64(4), int64(11), object(8)
memory usage: 5.6+ GB

In [19]:
df_ords.shape

(32404859, 24)

In [20]:
# Merge the both dataframes
df_final = df_ords.merge(df_cust, on = 'user_id', indicator = 'exist')

In [21]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 34 columns):
 #   Column                         Dtype
---  ------                         -----
 0   product_id                     int64
 1   product_name                   object
 2   aisle_id                       int64
 3   department_id                  int64
 4   prices                         float64
 5   order_id                       int64
 6   user_id                        int64
 7   number_of_orders               int64
 8   orders_day_of_week             int64
 9   order_hour_of_day              int64
 10  days_since_prior_order         float64
 11  add_to_cart_order              int64
 12  reordered                      int64
 13  _merge                         category
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int64
 19  loyalty_flag                   object
 20  mean_price                     float64
 21  spending_flag                  object
 22  median_days_since_prior_order  float64
 23  frequency_flag                 object
 24  first_name                     object
 25  surname                        object
 26  gender                         object
 27  state                          object
 28  Age                            int64
 29  date_joined                    datetime64[ns]
 30  dependants                     int64
 31  marital_status                 object
 32  income                         int64
 33  exist                          category
dtypes: category(2), datetime64[ns](1), float64(4), int64(14), object(13)
memory usage: 7.8+ GB

In [22]:
df_final.shape

(32404859, 34)

In [23]:
# exporting dataset as pickle format
df_final.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'final_.pkl'))